#########################################################################################################################################
# Индивидуальная практическая работа 1 по дисциплине ЛОИС
# Выполнена студентами группы 421702 БГУИР Шумиловым Артемом Андреевичем, Пушистовой Екатериной Сергеевной, Ященко Александрой Вадимовной
# Модуль логических операций (Вариант 1: t-норма min, импликация Гёделя)
# Версия 1.0 от 16.10.2024
#
# Практикум по логическим основам интеллектуальных систем / В. В. Голенков и др. — Минск: БГУИР, 2011.
##########################################################################################################################################


def godel_implication(a: float, b: float) -> float:
    """Нечёткая импликация Гёделя."""

    return 1.0 if a <= b else b


def t_norm_min(a: float, b: float) -> float:
    """Треугольная норма (нечёткая конъюнкция)."""
    
    return min(a, b)